app/views/events/show.html.erb

	<div>
		<h5>Organisateur:<%= @event.user.first_name %> <%= @event.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

		<h5>Lieu:<%= @event.venue %></h5>
		<h5>Participants: <%= @event.participations.count %> / <%= @event.places %></div>
---
SELECT "participations".* FROM "participations" WHERE "participations"."event_id" = ?  [["event_id", 3]]
SELECT COUNT(*) FROM "participations" WHERE "participations"."event_id" = ?  [["event_id", 3]]