app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY "events"."event_date" ASC
---
	def index
		@events = Event.order(:event_date).all

INSERT INTO "events" ("name", "organizer", "venue", "description", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["organizer", ""], ["venue", ""], ["description", ""], ["address", ""], ["created_at", "2015-11-19 13:25:29.638685"], ["updated_at", "2015-11-19 13:25:29.638685"]]
---
	def create
		@event = current_user.events.build(event_params)
		if	@event.save

UPDATE "events" SET "places" = ?, "user_id" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["places", 23], ["user_id", 1], ["updated_at", "2015-11-21 19:25:58.045083"], ["id", 10]]
---
	def update
		if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 12]]
---
	def destroy
		if @event.destroy

INSERT INTO "participations" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["event_id", 1], ["created_at", "2015-11-19 17:02:41.196649"], ["updated_at", "2015-11-19 17:02:41.196649"]]
---
	def participate
		Participation.create(user_id: current_user.id, event_id: params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 16]]
---
	def find_envent
		@event = Event.find(params[:id])