app/controllers/users_controller.rb

	def show
		@user = current_user
		@events = @user.events.order(:created_at)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  ORDER BY "events"."created_at" ASC  [["user_id", 1]]